ms_backend/backend/controllers/BowenController.php

SELECT * FROM `man_category` WHERE `is_show`=1
---
    public function actionIndex()
    {

        $fication=new Man_category();
        $te=$fication->find()->where(['is_show'=>1])->asArray()->all();