ms_backend/backend/controllers/CommonController.php

SELECT * FROM `auth_assignment` WHERE `user_id` IS NULL
SELECT * FROM `auth_item_child` WHERE (`parent`='è‘£äº‹é•\¿') AND (`child`='rbac/assign')
---
	public function beforeAction($action)
	{

		//判断是否有权限
		$auth_item_child=new Auth_item_child();
		$auth_assignment=new Auth_assignment();
		//查看session的用户ID；
		$session = \Yii::$app->session;
		$session->open();
		$admin = $session->get('admin');

		//根据session的用户ID查库有没什么角色；

     	$sql=$auth_assignment->find()->where(['user_id'=>$admin])->asArray()->one();
        $item=$sql['item_name'];

        if(!empty($item))
		{

			//获取控制器和方法
			$action = Yii::$app->controller->id.'/'.Yii::$app->controller->action->id;
			//根据角色查询有什么权限；
			$child=$auth_item_child->find()->where(['parent'=>$item,'child'=>$action])->asArray()->all();