ms_backend/backend/controllers/LoginController.php

SELECT * FROM `man_admin` WHERE `username`='liuzeping'
---
        public function actionAdd()

        {

            $request=\Yii::$app->request;
            $re=$request->post();
            $login=new Man_admin();
            $username=trim($re['username']);
            $password_hash=md5($re['password']);
            if($username =="")
            {
                echo "<script>alert('登录失败'); history.go(-1)</script>";die;
            }
            if($password_hash =="")
            {
                echo "<script>alert('登录失败'); history.go(-1)</script>";die;
            }
            $list=$login->find()->where(['username'=>$username])->asArray()->one();